{
    "version": "https://jsonfeed.org/version/1",
    "title": "Triple Eh?",
    "description": "Triple Eh? Ltd.",
    "home_page_url": "https://www.triple-aye.com/",
    "feed_url": "https://www.triple-aye.com/feed.json",
    "author": {
        "name": "Gareth Noyce"},
    "items": [
      {
            "id": "https://www.triple-aye.com/2019/07/03/Dev-Vlog:-009---Starting-on-the-Combat",
            "url": "https://www.triple-aye.com/2019/07/03/Dev-Vlog-009-Starting-on-the-Combat/",
            "title": "Dev-Vlog: 009 - Starting on the Combat",
            "content_html": "<p>I’ve finally bitten the bullet and started on the combat system. Here’s a <a href=\"https://www.youtube.com/watch?v=EmtR1sNbWl4\">little video</a> discussing it.</p>\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/EmtR1sNbWl4\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe>\n\n<p>It’s been a really busy month. I’ve nearly shipped an iOS game (contract work), Cecconoid’s store presences are \nbasically done, the trailer is up and I’m slowly gathering wishlists. Unfortunately a lot of the work I’ve been \ndoing isn’t on my own projects, but that’s a good problem to have. :)</p>",
            "summary": "I’ve finally bitten the bullet and started on the combat system. Here’s a little video discussing it.",
            "date_published": "2019-07-03T00:00:00+01:00",
            "date_modified": "2019-07-03T00:00:00+01:00",
            "author": {
              "name": "Gareth Noyce"},
            "tags": []},{
            "id": "https://www.triple-aye.com/2019/06/08/Making-a-game-in-90-days...",
            "url": "https://www.triple-aye.com/2019/06/08/Making-a-game-in-90-days",
            "title": "Making a game in 90 days…",
            "content_html": "<p>Because of my involvement with the TAMK Games Academy I’ve had a bit of a voice in how the course is structured. Back when I first got involved, many years ago, students got \nthe opportunity to make one game over the course of a year, but I’ve long argued that more, smaller games, would give everyone involved a better insight into what it’s\nlike as a profession. It’s too easy for team members to hide, or worse, disappear, over a year-long project, and it’s practically impossible for a green software developer to \nrisk assess and get a handle on scope. Should those mistakes really mean they bounce out of the course with nothing to show for it? So now we get the students, in groups, to make one  game per semester.</p>\n\n<p>A semester isn’t a very long time – by the time you knock out holidays, and all the top and tail admin of getting things setup, it’s basically 3 months and change – so scope is a real issue. \nEvery developer has eyes bigger than their bellies, but young developers even more so, and it’s pretty \ncommon for one of the projects to fail. It can go one of two ways: the initial excitement of working in a team means the first project is wildly out of scope, has to be pared \nback (normally by me) and the result is a half finished mess. Or, the listeners in the class make a very small, very casual, single mechanic game, and manage to apply some \npolish to it, meaning their second project will be an attempt at an MMO. MM No! As they used to say at MGS.</p>\n\n<p>My advice has always been the same. Pick a single (or very fucking small) set of mechanic[s], that you can evolve over time, and use this to do some proper level design. \nEven better, steal an arcade game, or something small from the 16bit era, and clone it. You’ll still have to solve all the same problems as the original developers. But, do that\nand actually attempt to build the ramp for the player, from the initial introduction of the mechanic, to them finally acting like a master, and you’ll have a game with a bucket load of content. You \nmight even start to realise that polish takes up 90% of the time…</p>\n\n<p>But…</p>\n\n<p>I’ve never actually made a game in 90 days. Even with modern tools. (Don’t get me started on Game Jams, that’s a whole separate rant that I’ll save for another day)</p>\n\n<p>Back in Feb there was a small confluence of events that made me consider this. I was starting to notice that I was a little Rusty in C# and Unity – having moved to UE4 after Lumo – and \nI was also concerned that the programming students didn’t actually have access to a full, open source, reasonable quality game, made in Unity that they could draw \nfrom. I know from my own experience that I’ve learned far more from reading other people’s code than I have from a book (thank you John Carmack) so I figured this might be a really\nuseful diversion. So I set about making Cecconoid/Eugatron, which I’ve posted about in the last few Dev Vlogs.</p>\n\n<p>I’d set myself a deadline of the end of May – the same duration the students had – and that deadline’s made a nice whizzing sound as it’s gone past. So where am I?</p>\n\n<p>In short, not finished. Lol.</p>\n\n<p>Some stats:</p>\n\n<ul>\n  <li>Development ‘days’ spent so far: 71</li>\n  <li>Of those, full-time (6hrs or more): 50</li>\n  <li>550 commits to get to alpha</li>\n  <li>20k lines of code</li>\n  <li>260 sprites/env tiles made</li>\n  <li>50 levels in Eugatron</li>\n  <li>42 rooms in Cecconoid</li>\n  <li>6 power-ups</li>\n  <li>Dunno how many baddies, but double that, because each game mode ended up with it’s own version</li>\n  <li>30-ish unique SFX</li>\n  <li>~350 hours of work, so far…</li>\n</ul>\n\n<p>Most of those stats don’t surprise me. 350 hours sounds about right for a bare bones arcade game. But 20k lines of code? Damn, that’s way more than I would have guessed. \nTurns out Lumo was 120k, and that’s less than I would have guessed, so even after all these years I basically have no clue how much code a thing will take… Hmm.</p>\n\n<p>But, this really is just an alpha. The following are missing:</p>\n\n<ul>\n  <li>Cecconoid doesn’t have enough content. Maybe another 20 rooms needed</li>\n  <li>Eugatron isn’t balanced as well as I’d like. Probably a few more days to give that a proper tweak.</li>\n  <li>Neither mode actually has a high score table</li>\n  <li>Cecconoid doesn’t have a save game, although it’s debatable that it needs one</li>\n  <li>I’ll need to do some sort of settings screen, so the postFX work on a toggle</li>\n  <li>I’ve not produced a Linux version yet, but I will bet good money this will cause problems.</li>\n</ul>\n\n<p>So maybe another 5-10 days or work to get most of that knocked off.</p>\n\n<p>And then you have to consider the stores:</p>\n\n<ul>\n  <li>Steam: Leaderboards, controller, cloud saves, achievements, trading cards</li>\n  <li>Discord: Rich presence?</li>\n</ul>\n\n<p>Steam is reasonably easy, and it is the one thing that I can pretty much lift wholesale out of Lumo. But it’s still a few days work. Discord, well, lets maybe pass on that\nand save it for another game.</p>\n\n<p>But we’re still not done. The stores all need art of various sizes, all of which are different dimensions on each store. Hero images, capsule headers, icons, detail view listings,\npage banners, sale banners… it all adds up and very few of them can be cut-and-paste out of a single piece of key art. In fact, I’ve already spent three days \non this.</p>\n\n<p>Oh, and you need a trailer. And some screenshots. And a web page of some description…</p>\n\n<p>So Cecconoid isn’t finished. Although it kinda is. I mean, the fun, development part is basically done, bar the boring bits, but those boring bits are another 60-100 hours of work, if you count\nall the stuff needed to make it ready to sell.</p>\n\n<p>–</p>\n\n<p>It’s been an interesting experience to tackle a game in this way.</p>\n\n<p>Like every developer before me I still struggled with scope. I stupidly made two games (but, but, Eugatron!) instead \nof putting all my focus into Cecconoid, and then to make matters worse, spent days playing the thing I shouldn’t have made, trying to pop a million points.</p>\n\n<p>Unity still gets on my tits. There’s a massive amount of scaffold code that needed to be written just to get a well structured base for the game, and I’m spoiled that UE4 \njust provides all this stuff straight off the bat. The editor is absolutely rubbish for editing 2D tile based stuff, and their plugin for it didn’t come anywhere close to \ndoing what I needed. The UI stack still annoys the shit out of me. Input still isn’t fit for purpose, so I had to go back to InControl half-way through the project. The audio \nsystem is still laughable bare-bones unless you bring in FMOD (I didn’t). The project window, where you organise all the files, is so weak compared to UE4 that it gave me constant rage. In short, \nnone of the failings I wrote-up, post Lumo, have been addressed in a way that I’m happy with.</p>\n\n<p>But, Cecconoid does appear to work everywhere, even the web, and for that the Unity Player does deserve credit.</p>\n\n<p>Would the project have been done any faster in UE4? Probably not, as the C++ compile cycle is definitely slower than C#. But, I’ve noticed that it doesn’t take me very long \nto slip back into bad habits with C#. It’s far too easy to let things slide…</p>\n\n<p>So I’m in a lucky position where I’ve made a game that I wasn’t expecting to, and I’ve no immediate need to push it out to the stores. This gives me a rare chance to let the thing \nsit there for a while, meaning I can go back to it with a fresh set of eyes, do the balance pass, and give it a proper tweak without being caught up in all the niggles of development.</p>\n\n<p>But I’ve answered the question; yes, it’s definitely possible to make a good quality, simple game, in 90 days on your own. It’s probably not possible to make that and a Robotron clone, though.</p>\n\n<p>Oh, and, look, shiny trailer!</p>\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/lFtRonr1VqM\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe>\n\n<p>I’m going to be doing some contract work over the summer, but in-between that I’ll be back on Maenhir, and normal service will be resumed. Enjoy the sun, everyone!</p>",
            "summary": "Because of my involvement with the TAMK Games Academy I’ve had a bit of a voice in how the course is structured. Back when I first got involved, many years ago, students got the opportunity to make one game over the course of a year, but I’ve long argued that more, smaller games, would give everyone involved a better insight into what it’s like as a profession. It’s too easy for team members to hide, or worse, disappear, over a year-long project, and it’s practically impossible for a green software developer to risk assess and get a handle on scope. Should those mistakes really mean they bounce out of the course with nothing to show for it? So now we get the students, in groups, to make one game per semester.",
            "date_published": "2019-06-08T00:00:00+01:00",
            "date_modified": "2019-06-08T00:00:00+01:00",
            "author": {
              "name": "Gareth Noyce"},
            "tags": []},{
            "id": "https://www.triple-aye.com/2019/05/07/Dev-Vlog:-008---Eugatron",
            "url": "https://www.triple-aye.com/2019/05/07/Dev-Vlog-008-Eugatron/",
            "title": "Dev Vlog: 008 - Eugatron",
            "content_html": "<p>Back again with a quick update.</p>\n\n<p>The Unity side-project is drawing to an end! The second game-mode, Eugatron, is basically done and now contains 50 levels\n of manic Robotron style blasting. I’ve gotta be honest, I’ve had a right laugh playing it, and spent waaaaay too long \n “testing” it. I’ve definitely coming back to this at some point in the future for a sequel.</p>\n\n<p>Here’s a quick video of me playing through it:</p>\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/JbF_Iz4KgZ0\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe>",
            "summary": "Back again with a quick update.",
            "date_published": "2019-05-07T00:00:00+01:00",
            "date_modified": "2019-05-07T00:00:00+01:00",
            "author": {
              "name": "Gareth Noyce"},
            "tags": []},{
            "id": "https://www.triple-aye.com/2019/04/03/Dev-Vlog-007---Where's-Wally-Been",
            "url": "https://www.triple-aye.com/2019/04/03/Dev-Vlog-007-Where's-Wally-Been/",
            "title": "Dev Vlog 007 - Where’s Wally Been?",
            "content_html": "<p>Damn, I’m sorry, it’s been ages. Honestly, between travel and the day job, the last couple of months have been mental. But here you go, a quick <a href=\"https://youtu.be/UbAxk4reW7g\">video</a> to catch up:</p>\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/UbAxk4reW7g\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe>\n\n<p>Also, I’ve just setup a <a href=\"https://vimeo.com/tripleeh\">Vimeo</a> channel, as the videos tend to be a little higher quality over there. I’ll try and keep it up-to-date from now on.</p>",
            "summary": "Damn, I’m sorry, it’s been ages. Honestly, between travel and the day job, the last couple of months have been mental. But here you go, a quick video to catch up:",
            "date_published": "2019-04-03T00:00:00+01:00",
            "date_modified": "2019-04-03T00:00:00+01:00",
            "author": {
              "name": "Gareth Noyce"},
            "tags": []},{
            "id": "https://www.triple-aye.com/2018/12/24/Dev-Vlog-006",
            "url": "https://www.triple-aye.com/2018/12/24/Dev-Vlog-006/",
            "title": "Dev Vlog 006",
            "content_html": "<p>Something unscripted, this time. A quick tour of the build as-is:</p>\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/jvTixxZzVAI\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe>\n\n<p><a href=\"https://www.youtube.com/watch?v=jvTixxZzVAI\">Direct Link</a></p>\n\n<p>Happy Xmas, everyone. I hope you and yours have a great holiday season. Fingers crossed 2019 isn’t as tumultuous as 2018…</p>",
            "summary": "Something unscripted, this time. A quick tour of the build as-is:",
            "date_published": "2018-12-24T00:00:00+00:00",
            "date_modified": "2018-12-24T00:00:00+00:00",
            "author": {
              "name": "Gareth Noyce"},
            "tags": []},{
            "id": "https://www.triple-aye.com/2018/12/01/Dev-Log:-New-Character,-Pick-ups-and-Chests",
            "url": "https://www.triple-aye.com/2018/12/01/Dev-Log-New-Character,-Pick-ups-and-Chests/",
            "title": "Dev Log: New Character, Pick-ups and Chests",
            "content_html": "<p>Another month, another quick video update. Lots of bits and pieces this month, with the most visual being the new character design, from Paul Large.</p>\n\n<p>Enjoy:</p>\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/_to4aS9m5XU\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe>\n\n<p><a href=\"https://youtu.be/_to4aS9m5XU\">Direct Link</a></p>",
            "summary": "Another month, another quick video update. Lots of bits and pieces this month, with the most visual being the new character design, from Paul Large.",
            "date_published": "2018-12-01T00:00:00+00:00",
            "date_modified": "2018-12-01T00:00:00+00:00",
            "author": {
              "name": "Gareth Noyce"},
            "tags": []},{
            "id": "https://www.triple-aye.com/2018/10/24/Dev-Log:-More-Fishing",
            "url": "https://www.triple-aye.com/2018/10/24/Dev-Log-More-Fishing/",
            "title": "Dev Log: More Fishing",
            "content_html": "<p>I’ve been busy this month. Firstly, I’ve agreed to work a couple of days a week for a start-up in Cambridge (outside of games), so now I have some income.</p>\n\n<p>The build has also taken some good steps forward. Phil (Dopedemand) is back, providing music for the game, which is fantastic. You can hear some of his work in the video below.</p>\n\n<p>And the fishing system is basically done. Lots of little things in this, but it feels good and I’m going to have some fun with it!</p>\n\n<p>Check out the <a href=\"https://www.youtube.com/watch?v=rhiSc1BlFdA\">Video Log</a> to see how I’m getting on:</p>\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/rhiSc1BlFdA\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen=\"\"></iframe>",
            "summary": "I’ve been busy this month. Firstly, I’ve agreed to work a couple of days a week for a start-up in Cambridge (outside of games), so now I have some income.",
            "date_published": "2018-10-24T00:00:00+01:00",
            "date_modified": "2018-10-24T00:00:00+01:00",
            "author": {
              "name": "Gareth Noyce"},
            "tags": []},{
            "id": "https://www.triple-aye.com/2018/09/13/Dev-Log:-Build-Update",
            "url": "https://www.triple-aye.com/2018/09/13/Dev-Log-Build-Update/",
            "title": "Dev Log: Build Update",
            "content_html": "<p>Woo, I’ve been on holiday! And done some stuff! And now I’m off to Finland to give some lectures on game design…</p>\n\n<p>So here’s a quick run-down of the bits and pieces I’ve been doing in-between all that…</p>\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/P8CE-d36OGs?rel=0\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen=\"\"></iframe>\n\n<p>Don’t forget, you can watch me streaming development most weekday mornings (GMT) on <a href=\"https://www.twitch.tv/tripleeh\">Twitch</a>.</p>",
            "summary": "Woo, I’ve been on holiday! And done some stuff! And now I’m off to Finland to give some lectures on game design…",
            "date_published": "2018-09-13T00:00:00+01:00",
            "date_modified": "2018-09-13T00:00:00+01:00",
            "author": {
              "name": "Gareth Noyce"},
            "tags": []},{
            "id": "https://www.triple-aye.com/2018/08/15/Dev-Log---Fishing",
            "url": "https://www.triple-aye.com/2018/08/15/Dev-Log-Fishing/",
            "title": "Dev Log - Fishing",
            "content_html": "<p>Time for another dev log, this time I’m doing a high level overview of what was involved in the basics of the fishing action.</p>\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/z6M-wUo-rM4\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen=\"\"></iframe>\n\n<p>Here’s a <a href=\"https://www.youtube.com/watch?v=z6M-wUo-rM4\">Direct Link</a> for those that prefer.</p>\n\n<p>It’s still a bit rough and ready, but I did spend some time to do a proper title. Small improvements ;D</p>",
            "summary": "Time for another dev log, this time I’m doing a high level overview of what was involved in the basics of the fishing action.",
            "date_published": "2018-08-15T00:00:00+01:00",
            "date_modified": "2018-08-15T00:00:00+01:00",
            "author": {
              "name": "Gareth Noyce"},
            "tags": []},{
            "id": "https://www.triple-aye.com/2018/07/30/Dev-Log---Player-Character-Actions",
            "url": "https://www.triple-aye.com/2018/07/30/Dev-Log-Player-Character-Actions/",
            "title": "Dev Log - Player Character Actions",
            "content_html": "<p>Here’s the first video Dev Log, where I discuss some of the Player Character Actions, and the systems I have to build under them.</p>\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/x2WHXuC23AQ\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen=\"\"></iframe>\n\n<p>Or a <a href=\"https://www.youtube.com/watch?v=x2WHXuC23AQ\">Direct Link</a> if you prefer.</p>\n\n<p>This is still very rough and ready. Rather than spend a couple of days doing fancy titles, sexy wipes, and capturing loads of video I just want to \nget something up, to get the ball rolling. I’ll slowly work to improve the overall quality as I do more videos.</p>\n\n<p>Don’t forget, you can always join me on <a href=\"https://www.twitch.tv/tripleeh\">Twitch</a>.</p>",
            "summary": "Here’s the first video Dev Log, where I discuss some of the Player Character Actions, and the systems I have to build under them.",
            "date_published": "2018-07-30T00:00:00+01:00",
            "date_modified": "2018-07-30T00:00:00+01:00",
            "author": {
              "name": "Gareth Noyce"},
            "tags": []}]
}