{
    "version": "https://jsonfeed.org/version/1",
    "title": "Triple Eh?",
    "description": "Triple Eh? Ltd.",
    "home_page_url": "https://www.triple-aye.com/",
    "feed_url": "https://www.triple-aye.com/feed.json",
    "author": {
        "name": "Gareth Noyce"},
    "items": [
      {
            "id": "https://www.triple-aye.com/2017/11/26/Devlog:-November",
            "url": "https://www.triple-aye.com/2017/11/26/Devlog-November/",
            "title": "Devlog: November",
            "content_html": "<p>Apologies for the long delay in posting. I’m ashamed to say that I’ve still not bought a coffee machine, but it’s not stopped me from having a fairly productive few weeks.</p>\n\n<p>##Lumo</p>\n\n<p>Yes, it’s finally out on the Switch and just in time for Xmas! The port was done by Spiral House Ltd and I’m very pleased with the result. After all the hassles JAW had with Unity on Vita, I was\nworried that the same problems might plague Unity on the Switch, but fortunately that doesn’t appear to be the case.</p>\n\n<p>To all intents and purposes Lumo on the Switch is identical to the PS4 version, just capped at 30 fps. It’s also an unintentionally perfect game for the Switch, as the room based style of play \nmeans you can pick it up for 10 minutes, run about and then put it down. Obviously I’m a massive fan-boy for the Switch, but I really did enjoy going back to the game and playing it on the go. It feels perfect.</p>\n\n<p>There are physical copies in the EU and US, but not a lot of them so hit up Amazon if you’re after one. They’re going to disappear quickly.</p>\n\n<p>Fortunately I’ve not had to do much PR for this release, but I did do an <a href=\"https://www.reddit.com/r/NintendoSwitch/comments/7e9iyn/im_gareth_noyce_the_developer_of_lumo_ask_me/\">AMA on r/NintendoSwitch.</a> Many thanks to Tim and the other mods there for inviting me on. :)</p>\n\n<p>##Little Breton</p>\n\n<p>With Psyance parked until I decide how to get some art done, I’ve moved on to the other idea that’s been bubbling away in the back of my head. In some respects this is a bit of a spiritual sequel to Lumo, as \nthe big problem I kept facing when making that game was to stop myself from turning it into a massive Zelda dungeon. Head over Heels and co. largely kept their puzzles restricted to single rooms, and so I wanted Lumo \nto stick to that template, which meant not doing certain things.</p>\n\n<p>So sod it, it’s time to make some Zelda dungeons :)</p>\n\n<p><img src=\"/images/LittleBreton.jpg\" alt=\"Little Breton\" /></p>\n\n<p>I’ll post more info on this after Xmas. For now I’m busy making modular art pieces so I can start sketching out a world to run around in.</p>",
            "summary": "Apologies for the long delay in posting. I’m ashamed to say that I’ve still not bought a coffee machine, but it’s not stopped me from having a fairly productive few weeks.",
            "date_published": "2017-11-26T00:00:00+02:00",
            "date_modified": "2017-11-26T00:00:00+02:00",
            "author": {
              "name": "Gareth Noyce"},
            "tags": []},{
            "id": "https://www.triple-aye.com/2017/10/29/Devlog:-Upheaval",
            "url": "https://www.triple-aye.com/2017/10/29/Devlog-Upheaval/",
            "title": "Devlog: Upheaval",
            "content_html": "<p>I’ve lost count of the number of times I’ve moved house. Enough that I should be a bit of an expert at it, or at least, not underestimate how long it takes to sort everything out once I’ve “unpacked”. As it was, the first three weeks of October were a right-off, but bar buying a new coffee machine I’m basically good to go, I‘m back on the ‘net, and I’ve just come back from a much more chilled few days in the UK to celebrate my birthday.</p>\n\n<p>Go go go!</p>\n\n<p>Unfortunately, a few more things changed than just my location. It’s been a weird month.</p>\n\n<h2 id=\"next-game\">Next Game</h2>\n\n<p>I’ve not written about this in detail for a while, mainly because progress has been so stop-start it’s been hard to wrap-up the work into an interesting post.</p>\n\n<p>Where am I? I think from the code point of view I’ve got pretty much everything in place for a networked, multi-player game. Steam integration is working, you can join / leave hosted games through friend invites, browsing for public hosted games works, the co-op and TDM modes work, environmental stuff like trigger operated doors and moving platforms are in, pick-ups, weapon types, ammo, projectiles, area explosions, AI spawning, death— everything you’d expect from a game of Quake — is in and working. But it’s hit a wall.</p>\n\n<p>I’ve lost some collaborators (totally understandably, and I’m amazingly grateful for their help to-date) and I’ve not got the money to sub-contract out in order to hit the quality bar that I want. So I’m left with a choice: rollback on the art/audio/VFX-sides, and maybe go for something like Strafe or Gibhard, or, come back to this project if-and-when I have the cash to bring on a couple of people for a few months.</p>\n\n<p>I probably could hit a nice retro-feel with some low poly characters and pixely textures, but I think Strafe’s got that covered now and I don’t want to re-tread that ground. Going even more coarsely grained, almost Doom2-like, is an option, but again, feels like a step back from what I have in my head. So I’m going to park this.</p>\n\n<p>If I’m honest, every step in this project has been just a smidge harder than it should have been, not least because of some seismic shifts in my personal-life that have royally fucked my ability to focus, but I’m inclined to listen to the universe and accept that this “isn’t the one”. Meh.</p>\n\n<p>I still want to make a really fucking fast, twitchy FPS, so I’m not ready to let this go completely. Which means maintaining it with each UE4 upgrade and biding my time…</p>\n\n<h2 id=\"neutrino\">Neutrino</h2>\n\n<p>Man, I’m so fucking glad that I decided to roll with a little side-project, post Lumo. Being able to work on something when surrounded by boxes, on a train, bus, or stuck in an airport, has been a life-saver. I’d be much more stressed if I was looking back on October as being entirely unproductive.</p>\n\n<p>The fruits of this half-arsed labour?</p>\n\n<p><img src=\"images/Neutrino_BulletEd.gif\" alt=\"GunEd\" /></p>\n\n<p>Behold, my nearly finished Gun Editor.</p>\n\n<p>Yup, dead simple, probably only a day’s work, but I’ve also gone through and cleaned up a few hanging TODO items, and added viewport scaling to the mouse wheel for the editor modes.</p>\n\n<p>I need to add the bullet definitions to this, then do a particle emitter editor, at which point I literally have no more excuses. I need to be making a game with this. But I’m not going to go back to it until Xmas.</p>\n\n<p>I have a cunning plan…</p>",
            "summary": "I’ve lost count of the number of times I’ve moved house. Enough that I should be a bit of an expert at it, or at least, not underestimate how long it takes to sort everything out once I’ve “unpacked”. As it was, the first three weeks of October were a right-off, but bar buying a new coffee machine I’m basically good to go, I‘m back on the ‘net, and I’ve just come back from a much more chilled few days in the UK to celebrate my birthday.",
            "date_published": "2017-10-29T00:00:00+03:00",
            "date_modified": "2017-10-29T00:00:00+03:00",
            "author": {
              "name": "Gareth Noyce"},
            "tags": []},{
            "id": "https://www.triple-aye.com/2017/09/23/Devlog:-Curves",
            "url": "https://www.triple-aye.com/2017/09/23/Devlog-Curves/",
            "title": "Devlog: Curves",
            "content_html": "<p>I’m in the process of packing up my life for the move back to Tampere, so this will be the last catch-up blog until I’m setup again. Meh.</p>\n\n<h3 id=\"neutrino\">Neutrino</h3>\n\n<p>I’ve done a fair bit more work on this, due to travel, downtime waiting for estate agents and the start of the new Semester at University. The “big” new item is the curve editor.</p>\n\n<p>I want the enemies to have pretty varied attack patterns, and although a lot of this could be done with the judicious use of Sine, you can’t beat having a decent spline to hand.</p>\n\n<p>There’re a few ways you can do this, but I’ve opted for chaining cubic Bézier curves together, as the maths is about my level.</p>\n\n<p><img src=\"/images/curve_math.png\" alt=\"Maths.... Ugh\" /></p>\n\n<p>Or, in code:</p>\n\n<figure class=\"highlight\"><pre><code class=\"language-c\" data-lang=\"c\"><span class=\"n\">glm</span><span class=\"o\">::</span><span class=\"n\">vec2</span> <span class=\"n\">CalculateBezierPoint</span><span class=\"p\">(</span><span class=\"k\">const</span> <span class=\"kt\">float</span> <span class=\"n\">t</span><span class=\"p\">,</span> <span class=\"k\">const</span> <span class=\"n\">glm</span><span class=\"o\">::</span><span class=\"n\">vec2</span><span class=\"o\">*</span> <span class=\"n\">p0</span><span class=\"p\">,</span> <span class=\"k\">const</span> <span class=\"n\">glm</span><span class=\"o\">::</span><span class=\"n\">vec2</span><span class=\"o\">*</span> <span class=\"n\">p1</span><span class=\"p\">,</span> <span class=\"k\">const</span> <span class=\"n\">glm</span><span class=\"o\">::</span><span class=\"n\">vec2</span><span class=\"o\">*</span> <span class=\"n\">p2</span><span class=\"p\">,</span> <span class=\"k\">const</span> <span class=\"n\">glm</span><span class=\"o\">::</span><span class=\"n\">vec2</span><span class=\"o\">*</span> <span class=\"n\">p3</span><span class=\"p\">)</span> \n<span class=\"p\">{</span>\n    <span class=\"kt\">float</span> <span class=\"n\">fT</span> <span class=\"o\">=</span> <span class=\"n\">clamp</span><span class=\"p\">(</span><span class=\"n\">t</span><span class=\"p\">,</span> <span class=\"mi\">0</span><span class=\"p\">.</span><span class=\"mi\">0</span><span class=\"n\">f</span><span class=\"p\">,</span> <span class=\"mi\">1</span><span class=\"p\">.</span><span class=\"mi\">0</span><span class=\"n\">f</span><span class=\"p\">);</span>\n    <span class=\"kt\">float</span> <span class=\"n\">u</span> <span class=\"o\">=</span> <span class=\"mi\">1</span> <span class=\"err\">—</span> <span class=\"n\">fT</span><span class=\"p\">;</span>\n    <span class=\"kt\">float</span> <span class=\"n\">tt</span> <span class=\"o\">=</span> <span class=\"n\">fT</span><span class=\"o\">*</span><span class=\"n\">fT</span><span class=\"p\">;</span>\n    <span class=\"kt\">float</span> <span class=\"n\">uu</span> <span class=\"o\">=</span> <span class=\"n\">u</span><span class=\"o\">*</span><span class=\"n\">u</span><span class=\"p\">;</span>\n    <span class=\"kt\">float</span> <span class=\"n\">uuu</span> <span class=\"o\">=</span> <span class=\"n\">uu</span> <span class=\"o\">*</span> <span class=\"n\">u</span><span class=\"p\">;</span>\n    <span class=\"kt\">float</span> <span class=\"n\">ttt</span> <span class=\"o\">=</span> <span class=\"n\">tt</span> <span class=\"o\">*</span> <span class=\"n\">fT</span><span class=\"p\">;</span>\n    <span class=\"n\">glm</span><span class=\"o\">::</span><span class=\"n\">vec2</span> <span class=\"n\">p</span> <span class=\"o\">=</span> <span class=\"n\">glm</span><span class=\"o\">::</span><span class=\"n\">vec2</span><span class=\"p\">(</span><span class=\"n\">uuu</span> <span class=\"o\">*</span> <span class=\"o\">*</span><span class=\"n\">p0</span><span class=\"p\">);</span>\n    <span class=\"n\">p</span> <span class=\"o\">+=</span> <span class=\"mi\">3</span> <span class=\"o\">*</span> <span class=\"n\">uu</span> <span class=\"o\">*</span> <span class=\"n\">t</span> <span class=\"o\">*</span> <span class=\"o\">*</span><span class=\"n\">p1</span><span class=\"p\">;</span>\n    <span class=\"n\">p</span> <span class=\"o\">+=</span> <span class=\"mi\">3</span> <span class=\"o\">*</span> <span class=\"n\">u</span> <span class=\"o\">*</span> <span class=\"n\">tt</span> <span class=\"o\">*</span> <span class=\"o\">*</span><span class=\"n\">p2</span><span class=\"p\">;</span>\n    <span class=\"n\">p</span> <span class=\"o\">+=</span> <span class=\"n\">ttt</span> <span class=\"o\">*</span> <span class=\"o\">*</span><span class=\"n\">p3</span><span class=\"p\">;</span>\n    <span class=\"k\">return</span> <span class=\"n\">p</span><span class=\"p\">;</span>\n<span class=\"p\">}</span></code></pre></figure>\n\n<p>ImGui has been a lifesaver, again, as it took very little time to put together enough UI to load, save and edit curves. There’s no real limit to the number of curves I can chain together, but in practice, two or three is more than enough. It’s simple, but it works.</p>\n\n<p><img src=\"/images/NeutrinoCapture_23.09.17.gif\" alt=\"Fancy Gif\" /></p>\n\n<p>The other nice addition to Neutrino, as you can see above, is embedded .GIF output. Totally stole this idea from <a href=\"https://twitter.com/niinegames\">Philip Bak</a>, but it makes perfect sense; in a world where you need to fire out screenshots on social media as often as possible, what could be better than pressing a button and getting an animated .GIF, resized for Twitter?</p>\n\n<p>We both opted to use this <a href=\"https://github.com/ginsweater/gif-h\">single header</a> lib from Charlie Tangora. 3 function calls and Bob’s your mother’s brother. Perfect.</p>\n\n<p>Other stuff that’s been done:</p>\n\n<ul>\n  <li>Simple timer based callbacks, so single entities don’t need to constantly poll their state, they can just ask to do something in the future.</li>\n  <li>Start of a level sequencer… This is based off the camera position, and will be responsible for doing all the spawning and in-game events. I’ll probably do a ImGui editor for this and talk about it in a future post</li>\n  <li>Roughly sketched out how enemy entities will work. I’m trying to do existence based processing using a table layout — I’m high on Data Oriented Design kool-aid — so I’ll talk about this in a future post, once I’ve worked out how I’m doing it.</li>\n  <li>Ran the codebase through Valgrind and removed a bunch of silly little memory leaks. One problem with the stop/start nature of the way I work on this is that, sometimes, if I have to stop in the middle of something, I forget to go back and clean-up after myself. I’ve got into the habit of just checking periodically in-case I’ve done something stupid. Normally I have ;D</li>\n</ul>\n\n<p>Anyway, I better get back to packing boxes ;D</p>",
            "summary": "I’m in the process of packing up my life for the move back to Tampere, so this will be the last catch-up blog until I’m setup again. Meh.",
            "date_published": "2017-09-23T00:00:00+03:00",
            "date_modified": "2017-09-23T00:00:00+03:00",
            "author": {
              "name": "Gareth Noyce"},
            "tags": ["Neutrino","Devblog"]},{
            "id": "https://www.triple-aye.com/2017/09/05/Devlog:-Grab-bag-catch-up-post...",
            "url": "https://www.triple-aye.com/2017/09/05/Devlog-Grab-bag-catch-up-post",
            "title": "Devlog: Grab bag catch-up post…",
            "content_html": "<p>I’m waaaay overdue a post.</p>\n\n<p>A lot has been going on, on the dev-side, and in my personal life. I’ve had a bit of a holiday, I’ve been to the UK and back, and I’m at the start of trying to move away from Helsinki, and back to Tampere. My plans of a heads down summer of work didn’t really happen. Oh well :D</p>\n\n<h2 id=\"neutrino\">Neutrino</h2>\n\n<p>Due to the travel, hanging about in airports and nights in hotels, Neutrino has had a fair bit of attention. Effectively the engine side of it is complete.</p>\n\n<p>Box2D has been integrated. I’m not a massive fan of Box2D, but it’s simple enough to use and reasonably fast for a small number of objects. I’ve gone the whole hog this time and written the debug renderer for the physics world! Seeing what’s happening under the hood really does make a difference.</p>\n\n<p>Neutrino is still single threaded, and still, effectively, vsync locked. I’m going to do a bit of work at some point to move Box2D over to another thread and fix the fucking timestep, at which point it’d be interesting to see it run on a GSync screen. But anyway…</p>\n\n<p><img src=\"/images/2017-09-05-DebugRender.png\" alt=\"Debug Rendering\" /></p>\n\n<p>Still not much to look at, but it’s getting there. Next step is to make a particle emitter editor, bullet trajectory “pattern” editor and a spline editor for the attack waves. Then I think I can make some levels…</p>\n\n<h2 id=\"next-game\">Next Game</h2>\n\n<p>A month or so ago I decided that I had a lot of bits, but I didn’t have a game. I really should start putting this all together.</p>\n\n<p>Steam’s a good forcing function for this: If I’m going to make an online game then I really need to have it running through Steam and then get some other people to play it! To do that, I’ll need working UI and a proper flow in-and-out of the various game modes.</p>\n\n<p>UI in UE4 is pretty lovely. UMG has its quirks, but it works, looks good, and compared to the complete abomination in Unity, is a joy to put together. And — shock — I really like Blueprints for chaining UI together. Delay node ftw!</p>\n\n<p>That being said, there’s still a lot of UI screens to put together — once you throw in game-modes, with options, lobby screens, error handling etc. — but I have a working screen for each part of this (with no real thought applied to the styling atm) and I’m able to enter and exit a game.</p>\n\n<p>Online Session handling (like pretty much everything else in UE4) is piss poorly documented. There’s a video showing you how to do it in Blueprints, and a working example in Shooter Game that does it in C++. Because it’s so intrinsically tied to the UI, for the first pass I opted to start a simple blueprint session and see if I can connect to it via Steam. This took the better part of a day, but it does actually work; I can see hosted games over Steam, pull up some small bits of information about them, and I can join and leave a session. Wow!</p>\n\n<p>The problem is, the blueprint stuff doesn’t really have any idea about any of the custom parameters that define a hosted session, so I’m going to have to go back under the hood and do this properly in C++. Then I can filter against game mode, see the name of the server, handle friend invites and the like. But for now, just for the purposes of development, I have a “game” that I can upload to Steam, send to friends, and we can run about and shoot each.</p>\n\n<p>Time to grey box some levels to run around in.</p>",
            "summary": "I’m waaaay overdue a post.",
            "date_published": "2017-09-05T00:00:00+03:00",
            "date_modified": "2017-09-05T00:00:00+03:00",
            "author": {
              "name": "Gareth Noyce"},
            "tags": []},{
            "id": "https://www.triple-aye.com/2017/07/20/Work-In-Progress",
            "url": "https://www.triple-aye.com/2017/07/20/Work-In-Progress/",
            "title": "Work In Progress",
            "content_html": "<p>Quick little update, especially for those of you that actually follow the blog, rather than catch me on Tumblr or Medium. Here’s the progress that I’ve been making on the AI in the test dungeon over the last 3 weeks:</p>\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/AUwQYHzczTQ\" frameborder=\"0\" allowfullscreen=\"\"></iframe>\n\n<p>I need to add in some animations to emphasis when he’s searching for you, and when he’s fleeing from you, along with some audio barks so it’s clear that the modes have changed. But he’s running about, shooting and trying his \nbest not to be a completely static target. Good enough, for now, but I’ll be coming back to this a lot over the course of development.</p>",
            "summary": "Quick little update, especially for those of you that actually follow the blog, rather than catch me on Tumblr or Medium. Here’s the progress that I’ve been making on the AI in the test dungeon over the last 3 weeks:",
            "date_published": "2017-07-20T00:00:00+03:00",
            "date_modified": "2017-07-20T00:00:00+03:00",
            "author": {
              "name": "Gareth Noyce"},
            "tags": ["Next","Game,","WIP,","AI","Development"]},{
            "id": "https://www.triple-aye.com/2017/07/17/Devlog:-Oh-Behave...",
            "url": "https://www.triple-aye.com/2017/07/17/Devlog-Oh-Behave",
            "title": "Devlog: Oh Behave…",
            "content_html": "<p><img src=\"/images/2017-07-14-Behave.png\" alt=\"Behaviour Tree\" /></p>\n\n<p>Finally. I’ve got around to some game-play programming…</p>\n\n<p>My natural instinct when approaching this is to getting busy building a finite state machine, the core of which can be shared over the AI in my game, and then start building some instances to see what I like and what I don’t.</p>\n\n<p>UE4, unsurprisingly, is reasonably opinionated about how you should approach this and has its own system: Behaviour Trees. I’ve seen the BT system mentioned by quite a few devs over the last couple of months, and read bits and pieces about how to use it prior to rolling up my sleeves. I was quite excited to jump-in, but over the course of the last ten days I think I’ve gone through at least half of the seven stages of grief just trying to find a way of working with it that I can live with…</p>\n\n<p>One reason for this — and the thing that consistently annoys me about learning modern tools — is the absolute piss-poor state of documentation. I will never understand why people think scrubbing through hours of video is better than concise, written explanations of something, but there you go. Good technical documentation is a dying breed.</p>\n\n<p>The BT system does do slightly better than expected in this regard, as there’s a relatively skinny HOWTO that walks you through the basics, but A) It’s blueprint orientated and B) AI also has to drive animation, and audio, and oh-my-god-stuff-needs-to-be-replicated-and-why-the-fuck-isn’t-this-working-what-the-fuck-simple-thing-have-I-missed-now <em>sob</em>. Etc.</p>\n\n<p>Ok, I’m slightly exaggerating, but after a day of use my initial impression of the whole thing was that it was a teensy bit over engineered. Not designed for me. And I didn’t like it.</p>\n\n<p>I’ve slightly changed my mind since…</p>\n\n<p>–</p>\n\n<p>My simple starter AI character has a few states:</p>\n<ul>\n  <li>Idle</li>\n  <li>Idle at attention</li>\n  <li>Patrolling</li>\n  <li>Trying to get close to the Player</li>\n  <li>Leeroy Jenkins</li>\n  <li>Looking for a player that it’s just lost sight of</li>\n</ul>\n\n<p>Some of this information needs to be passed to the animation blueprint (being at attention, for example, or aiming at something) so the correct set of animations get played. Some of this information needs to be replicated, so clients see the correct thing.</p>\n\n<p>A Behaviour Tree’s Blackboard is basically designed to support this, being a slightly decoupled place to store data that a BT uses to make decisions, and that the rest of your code can then modify &amp; grab, as required. But that means touch-points in multiple places; the character blueprint, custom events to populate the animation blueprint, the AI Controller… in addition to the things that make the BT tick: the functions that make decisions and the services that perform checks.</p>\n\n<p>I really don’t like this. Debugging this stuff is a fucking nightmare. You end up with windows and breakpoints everywhere, and the relevant data is spread too far. I like my parameters in one place and I like to be able to quickly read state at runtime, preferably in one place, so my first foray into this wonderful world (using blueprints only) gave me the heebie jeebies, and worse, didn’t end up working correctly. I have no idea why.</p>\n\n<p><img src=\"/images/2017-07-14-DebuggingMess.png\" alt=\"Mess\" /></p>\n\n<p>By this point I’ve gone through the first three stages of grief, although mostly “Anger and Frustration”. So I decided in the “Depression” stage to have a go at a pure C++ AI, and check out what else the engine had to offer. This lead me to the AI Perception system, which on paper looks great: Sight, Sound, Damage and Touch events for your AI, just by adding a simple component. Woo! And at least half of that system works! The rest, largely undocumented, doesn’t appear to, but it’s labelled WIP so this is either my fault, or there’s some arcane magic that I’m missing.</p>\n\n<p>After an hour I really couldn’t be arsed stepping through the code to work out which, so I reverted back to the old Pawn Sensing stuff. This clearly isn’t as good, and it doesn’t provide anywhere near as fancy debugging output (which I’m a sucker for) but it works, and I could move on.</p>\n\n<p>After a day I had my FSM, a little AI dude, a derivation of the player weapons that the AI could use to kill me, and everything was working in co-op with a connected second player. Hurrah! Except that’s only the tip of the iceberg. This stuff only looks good, or becomes convincing, when the transitions between the states have some range of probability, a bit of variation, and reactions can be deferred a little. This means adding transitional states, which means FSMs in code quickly become unwieldy. Adding time delays to state changes also makes things harder to read…</p>\n\n<p>I wasn’t excited about carrying this forward and then having to debug it at some point in the future, and I do want something a tiny bit more advanced that Doom’s AI, so on reflection, straight C++ didn’t seem like the best bet either.</p>\n\n<p>The upward turn (grief stage 5, apparently) was when I worked out how to use BTs with C++. Even moving the tasks — operations in a BT that do something to the character or it’s data — to C++ is a massive win. I can debug my character, my controller and individual AI tasks within Visual Studio, with a decent call-stack and inspector, and use the BT to add in all the little random waits, variations, or sub-routes, without clogging up the code. Things immediately started looking better.</p>\n\n<p>Behaviour Trees also make the Environment Query System a tad easier to use and it seems like something that’s potentially cool, but I’ll be honest, I’m still on the up-hill climb with this. Have a look for yourself.</p>\n\n<p><img src=\"/images/2017-07-14-EQS.png\" alt=\"EQS\" /></p>\n\n<p>Spot the system written by a coder, for a coder.</p>\n\n<p>So far I’ve been able to use the EQS to generate random places to look for a player when the AI loses them, and random locations around the player, so the AI isn’t a stationary target when engaging. But I need to spend more time to actually understand how to use this system properly. Having the AI run for cover, or flank the player, would be cool and eminently doable.</p>\n\n<p><img src=\"/images/2017-07-14-DebuggingInGame.PNG\" alt=\"In Game\" /></p>\n\n<p>So where am I now?</p>\n\n<p>Well, the header image shows the BT I ended up with after all of this experimentation. One thing that’s abundantly clear is that using a BT to sense and make state decisions dynamically, each frame, isn’t the way to go. The stack of conditionals you end up with prior to running sequences and progressing down the tree is messy, and still not fun to debug. I’m going to re-do this next week, but with a stored “current state” that pulls from an enumerated list in the Blackboard. I’ll combine the pawn-sensing, via the AI controller, with the simple tests in the BT to change state at given circumstances, and write a small set of methods in the AI controller to set the animation params, replicate, and /or call multicast stuff for clients.</p>\n\n<p>I think this will reduce the surface area for debugging, make the BT itself a bit cleaner, and leave me with a small collection of C++ BT Tasks that I can re-use.</p>\n\n<p>But those could be famous last words of stage 7; acceptance and hope.</p>",
            "summary": "",
            "date_published": "2017-07-17T00:00:00+03:00",
            "date_modified": "2017-07-17T00:00:00+03:00",
            "author": {
              "name": "Gareth Noyce"},
            "tags": []},{
            "id": "https://www.triple-aye.com/2017/06/26/Devlog:-Frigging-in-the-Rigging...",
            "url": "https://www.triple-aye.com/2017/06/26/Devlog-Frigging-in-the-Rigging",
            "title": "Devlog: Frigging in the Rigging…",
            "content_html": "<p><img src=\"/images/rigging1.png\" alt=\"AI Test Dungeon\" /></p>\n\n<p>What I know about animation you could happily fit on the back of a postage stamp. I purposefully dodged it when making Lumo — through a cunning lack of in-game NPC characters — but I have vivid memories of swearing in 3DS Max for a couple of weeks, while trying to learn how to rig, then skin, what characters I did have. It was horrible, and the end result looks shite.</p>\n\n<p>Fortunately, you don’t get particularly close to the characters in Lumo, otherwise you’d notice lots of silly little folds and polygon creases where the skinning isn’t quite right. There’s one very obvious issue that’s visible in the close-up cut-scene, when you collect the wand, and it still annoys the shit out of me to this day.</p>\n\n<p>Anyway, that’s a long way of saying that, eek, I’m skinning / rigging the first character for Next Game. This time with Modo.</p>\n\n<p>As I’d not bothered adding any animation controls before, I figure it was time to do things “properly”, especially as the characters in Next Game will be much more in your face. There are some really nice tutorials on Plural Sight, which got me over the hump with this, but it’s still a long, incredibly boring process, that I’m ashamed to admit took me the better part of a week. It’s stupidly easy to get distracted when you’re just fiddling about with vert weights…</p>\n\n<p>But I have something that resembles an animation rig:</p>\n\n<p><img src=\"/images/rigging2.png\" alt=\"Almost looks like the real thing...\" /></p>\n\n<p>Once you get there, animating things is actually a lot of fun. I do really enjoy the process and I’ve got a new found respect for the people that do this well. Modo’s whole animation process — like the rest of the software — just fits my head, so it’s actually nice to sit there and tweak things, with the added bonus that the export process into UE4 is flawless, which is more than I can say for Max into Mecanim…</p>\n\n<p>One thing I love about animating in Modo is the Actions. These are short animation clips that are tucked away behind a little drop down menu. With Max I ended up with a timeline full of different animations, or multiple copies of the character, each with a different animation on. Now I have everything at my finger tips, and I can cut-and-paste bits between different animations. It’s clean, and it’s tidy, and it works. And when I export a single FBX, UE4 takes each Action and makes a single Animation Clip out of it. Each of these can be re-imported singularly, meaning iteration times are nice and short. Big thumbs up.</p>\n\n<p>After another week of fiddling, I ended up with this:</p>\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/qE7HklpJwG4\" frameborder=\"0\" allowfullscreen=\"\"></iframe>\n\n<p>I’ve never done a “proper” walk (or run) cycle before, so I’m pretty happy with those. There’re not perfect, for a start there’s not enough follow-through, or looseness, in the hands and arms. Particularly in the run cycle. I think that’s a result of me using an IK chain on those limbs, which limited my ability to control the elbow angle at certain points. It was fiddly to make sure the swing stayed in a clean arc as the body moved up and down, as well, so with hindsight, I don’t think I’ll use IK on the arms in future. Everything else, though? Not baaaaaad, 7/10.</p>\n\n<p>I’ve spent the rest of this week preparing to develop the character AI. I’ve created a new Game Mode for the co-op campaign, and I’m halfway through building an open space for the AI to run around in (see the screenshot at the top of this page).</p>\n\n<p>Next up: it’s all about UE4’s AI system…</p>",
            "summary": "",
            "date_published": "2017-06-26T00:00:00+03:00",
            "date_modified": "2017-06-26T00:00:00+03:00",
            "author": {
              "name": "Gareth Noyce"},
            "tags": []},{
            "id": "https://www.triple-aye.com/2017/06/03/Devlog:-The-Price-Is-Right",
            "url": "https://www.triple-aye.com/2017/06/03/Devlog-The-Price-Is-Right/",
            "title": "Devlog: The Price Is Right",
            "content_html": "<p><img src=\"/images/price1.jpg\" alt=\"Price is right!\" /></p>\n\n<p>So, some lucky person on the U.S. version of The Price is Right walked away with a copy of Lumo (plus Uncharted &amp; Ghostbusters) and a shiny PS4. That was a surprise, to say the least.</p>\n\n<p>I’ve not thought about the game in a while, but Lumo’s popped up three times this week: Once in the issue of Edge I was reading, once on the PC Gamer podcast, and now this. One year on — it was released on May 24th, so happy 1st birthday, little game! — and I’m still being surprised by it.</p>\n\n<h1 id=\"next-game\">Next Game</h1>\n\n<p>Last time I wrote I’d made the fairly drastic decision of binning most of my code and starting fresh, with a clean project, to build the networking from the ground up. I’ve continued down that path over the last couple of weeks, and bar a few exceptions — moving platforms, trigger spawns and a bit of front-end UI— I’m past where I was before “the great purge”.</p>\n\n<p>Unreal’s RPC &amp; replication system is actually pretty straight-forward, for the most part. And now I’ve got everything working I think I have a reasonably good understanding of it, but the documentation can definitely be improved. ShooterGame takes a fair old while to Grok.</p>\n\n<p>I’ve ended up structuring things as follows:</p>\n\n<h2 id=\"game-mode\">Game Mode</h2>\n\n<p>This mainly handles players logging in-and-out of the game session, as well as tracking which team the players are assigned to and what spawn points are available at any given time. Initial spawning (and re-spawning) are also handled here, as well as “starting” the game and passing that fact on to the Game State to track. What I’ve not done atm, but will have to go back to, is handling a clean exit out of a game and back to the main menu.</p>\n\n<p>Oh, and acceptance of invites to a running game, but that’s probably a problem for a different area…</p>\n\n<p>I am handling the travel between maps as the game defaults to starting in an empty one before jumping everyone to my test level when the host presses a button. That should “just work” when it comes to detecting end game logic, but we’ll see.</p>\n\n<h2 id=\"game-state\">Game State</h2>\n\n<p>This is doing very little right now apart from tracking if the game is running, and telling the HUD to switch between Lobby and In-Game presentations, if so. For the co-op games it’ll be tracking everything from number of pickups &amp; secrets collected, to how and why players got their score. I’d already written this code before the purge.</p>\n\n<h2 id=\"player-state\">Player State</h2>\n\n<p>This is the 3rd time I’ve tried to structure a player character in UE4 and this time, rather than split things like health and score between the Character and the Player State I’ve opted to put everything not related to movement, rendering and audio into the Player State. All changes to Player State values happen on the server and replicate out. All requests for information; “Can I change to this weapon?”, “Can I pick up this item”, etc. are all server authoritative, as well.</p>\n\n<p>Because of this there’s a lag in the update of a client player’s HUD, say when taking damage, as the new value may take a while to propagate over, but interestingly, all control related stuff is instant. I’m guessing this is the way UE4 networking is optimised internally. I’ll need to look into the HUD issues, but at a guess I can mirror values locally, do non-authoritative updates to them, and overwrite with replicated values when they appear. I doubt the player will care or notice.</p>\n\n<h2 id=\"player-controller\">Player Controller</h2>\n\n<p>I not done any customisation to the default player controller at the moment.</p>\n\n<h2 id=\"player-character\">Player Character</h2>\n\n<p>Re-writing this has been the biggest win, by far. It’s significantly less code than previously, and what I am replicating is done in a much cleaner fashion.</p>\n\n<p>Important control stuff, like firing/changing weapons is server authoritative and there are multicast functions for things like playing audio cues, or hit effects. Will this feel laggy in the real world? I’m not sure, but everything I’ve read points to this being the normal way to do things, and it’s absolutely fine in the test environment.</p>\n\n<p>I still need to put things like the damage beans back in, but that’s a five minute job…</p>\n\n<h2 id=\"other-stuff\">Other Stuff</h2>\n\n<p>Because I’m networked I’ve been able to spend a few days with the weapons, armour and damage calculations. I’ve ended up creating custom Damage Types, which I’m passing through the normal UE4 damage system. These are dead handy, and it means I can detect what weapon has been used, who fired it, and even scale damage down for things like my own rocket jumps. Or, muhaha, scale up because the player is on a multiplier…</p>\n\n<p>This obviously opens up the whole balancing can-of-worms, so for now I’ve side-stepped it by using a mixture of weapon damage values from Doom 2 and Quake 1. Just to get me started, like…</p>\n\n<p>My double barrel shotgun is fucking lethal, though. You do not want to be meeting that in a dark corridor.</p>\n\n<p>Armour has been interesting, not only how to scale the damage, but how to split the percentages between absorption and immediate health deductions. I can already tell that I’ll be moving this lever up and down until release…</p>\n\n<p>…</p>\n\n<p>It was a nervy few days, starting again, but it was the right choice. Doing networking with a bunch of existing code, that you need to break in many ways in the effort to rebuild, was absolutely the wrong way to go. So even though my current build doesn’t have the nice front end, and my test level is just a bunch of unused FBX files that haven’t even been imported, I have the basis for everything else going forward: a networked pvp environment that I can drop onto any level.</p>\n\n<p>Next up, animating this fella, before exploring how to do some AI against co-op chums.</p>\n\n<p><img src=\"/images/Copper.jpg\" alt=\"Copper\" /></p>",
            "summary": "",
            "date_published": "2017-06-03T00:00:00+03:00",
            "date_modified": "2017-06-03T00:00:00+03:00",
            "author": {
              "name": "Gareth Noyce"},
            "tags": ["Devlog"]},{
            "id": "https://www.triple-aye.com/2017/05/12/Devlog:-12.05.17---Replication",
            "url": "https://www.triple-aye.com/2017/05/12/Devlog-12.05.17-Replication/",
            "title": "Devlog: Replication",
            "content_html": "<p>First week back on Next Game, for oooh, a few weeks, and time to tackle the networking side of things. I had an inkling that retro-fitting multiplayer into the work I’d already done would be a bit of a ball-ache, but I was wrong. It was a massive fucking pain in the hairy-tits.</p>\n\n<p>The problem wasn’t so much that I didn’t understand the theory behind it all — although it does take a while to bed-in, and in all honesty Epic could really do with providing some better documentation on the C++ side of things — but that switching something simple, like the character responses to items being picked up, involves changing a lot of small bits of code in various classes. So where, sensibly, do you start?</p>\n\n<p>I tried a couple of things, first the pickups, then the weapons, but half-way through each it was clear that I’d basically have to refactor a whole bunch of supporting code. Admittedly, there’re some easy wins with the default replication that’s built into the engine; things move, things spawn and you can feel good about your progress quite quickly. But the devil’s in the detail. Do things destroy themselves correctly for client and server, when either side triggers the event? Are modifications happening on the server instance and replicating correctly? Should this multi-cast or is there a better way?</p>\n\n<p>And obviously, debugging this stuff isn’t fun when you have multiple copies of the same instance running, and try to breakpoint something.</p>\n\n<p>I spent four days poking about at this, and although I’d made pretty reasonable progress there were bugs, little fiddly fucks that I really didn’t want to carry along with me. So yesterday I started a clean project and wrote a very simple Team Deathmatch game. Even re-built the characters from the ground up, this time using the Animation Starter Kit from the UE4 Marketplace.</p>\n\n<p><img src=\"/images/2017-05-11-TDM_8Player.png\" alt=\"TDM\" /></p>\n\n<p>That’s not a particularly exciting screenshot, but it’s 8 players in a TDM game mode, with a dedicated server. Players automatically join and leave teams and you can run around and kill each other.</p>\n\n<p>If you’d told me a week ago that I’d effectively be starting from scratch to get this working I’d have given you the sad panda eyes, but now I’m on the other-side I’m happy. It was a good thing to do. I’m pretty confident I’m entering and exiting the game mode properly, I’m going through the login process and I’m cleaning transferring Player States and Controllers about. None of that was working 100% properly in the previous branch. And, I still have all the “old” code lying about. The HUDs, menus etc will “just work” when I drop them back in, and under the hood it’s going to be easier to migrate things over, piece-by-piece, test, and then move forward.</p>\n\n<p>So, lesson of the week — and worse, something I knew anyway — if you’re making a networked game, do it from the beginning, don’t try and bolt it on afterwards.</p>\n\n<p><em>Quite pleased I managed to get through all that without making the obvious “built to last” Bladerunner/Replicant joke.</em></p>\n\n<p><em>Oh.</em></p>",
            "summary": "First week back on Next Game, for oooh, a few weeks, and time to tackle the networking side of things. I had an inkling that retro-fitting multiplayer into the work I’d already done would be a bit of a ball-ache, but I was wrong. It was a massive fucking pain in the hairy-tits.",
            "date_published": "2017-05-12T00:00:00+03:00",
            "date_modified": "2017-05-12T00:00:00+03:00",
            "author": {
              "name": "Gareth Noyce"},
            "tags": []},{
            "id": "https://www.triple-aye.com/2017/04/29/Devlog:-Making-Pixels-Glow",
            "url": "https://www.triple-aye.com/2017/04/29/Devlog-Making-Pixels-Glow/",
            "title": "Devlog: Making Pixels Glow",
            "content_html": "<p>Easter and consultancy work have got in the way a bit, but the side project’s taken a big step forward…</p>\n\n<p><img src=\"/images/2017-04-28-AddedAudio.PNG\" alt=\"Screenshot\" /></p>\n\n<h1 id=\"neutrino\">Neutrino</h1>\n<p>When I last wrote Neutrino was rendering directly to the screen, which wasn’t exactly the look I was after for low resolution, pixel-based games. So last week I took a day to sit down and finish off the rendering path, with the aim being to have some control over the process and get closer to a CRT “glow”.</p>\n\n<p>I’ve ended up with a fairly standard process that you’ve probably read about before.</p>\n\n<p><em>Stage 1:</em> The background tile-map and all the sprites collected in the VBO during the current tick are rendered to a 480x270 pixel texture. I picked this size because it’s a quarter of a 1080p screen, so scales nicely to my 4k monitor, but isn’t too chunky as to leave pixels the size of my face on-screen.</p>\n\n<p><em>Stage2:</em> The texture generated in Stage 1 is then rendered to a second 480x270 texture, via a high-pass “filter”. Atm this filter checks for pixel luminance, rendering any pixel above a certain brightness as normal, and any below that level at some, definable, smaller multiple of itself. I could discard these failing pixels completely, but I found the effect looks nicer when there’s a ramp.</p>\n\n<p><em>Stage3:</em> The texture from stage 2 is blurred in two passes, once horizontally, and once vertically. The resolution of this can be defined at run-time, but I’ve found that I get good results by blurring the low resolution texture from stage 2, and then getting the benefits of bi-linear filtering as I draw the blurred result, enlarged, as part of the final composite</p>\n\n<p><em>Stage4:</em> I draw a single full-screen quad to the screen, using the low resolution texture from stage 1. This is rendered with a trivially simple “scanline” shader, that checks the output position of the pixel: Every other line is rendered “dark”, for the scanlines. For “normal” lines, the shader checks the pixel, rendering the 1st biased to red, the 2nd biased to green, the 3rd biased to blue and the 4th “dark”. After this, the same quad is re-drawn, but using the blurred textured from pass 4, and again, I have controls for how much this bloomed texture contributes…</p>\n\n<p>This is probably the simplest form of scanline effect. It’s not emulating PAL, or NTSC screens. There’s no phosphor persistence — although I probably will add that in, to a degree, by using the blurred “bloom” texture as an accumulator — and there is no barrel shifter to simulate the curve of an old screen.</p>\n\n<p>I did look at <a href=\"https://www.shadertoy.com/view/XsjSzR\">Tim Lottes CRT pixel shader</a> but it needs a fair amount of tweaking to run well on my X1’s Intel GPU. And there’s also Kyle PIttman’s <a href=\"http://www.gamasutra.com/blogs/KylePittman/20150420/241442/CRT_Simulation_in_Super_Win_the_Game.php\">shader from Super Win The Game</a>, which I also discounted.</p>\n\n<p>To be honest, I’m not going for either of these looks. All I actually care about is the feel of staring into an arcade, in a dark room, where those white pixels were too white, and where certain colours left a bit of a tint on your eyeball. The screenshot at the top of the page is a fairly toned down example of where I’ll end up, cos, If I crank some of the settings up, I can get to some pretty mad places.</p>\n\n<p>All of this will be optional for the player. I know some people hate scanlines — why emulate broken technology? — but I’ll probably setup a few different presets to pick and choose from, so those of us of a certain vintage feel a bit more at home.</p>\n\n<p>(I’d be tempted to leave all the settings available, but that’d probably mean that every time I saw a screenshot of the game online it’d be at some crazy-bastard setting, that I hate…)</p>\n\n<p>Possible todo items: Adding some saturation controls to this may be handy. And maybe a colour look-up table, so I can set curves in Affinty Photo and have them baked into the final output?</p>\n\n<h1 id=\"next-game\">Next Game</h1>\n<p>I’m dead excited. Hoping to have more to show soon. ;)</p>",
            "summary": "Easter and consultancy work have got in the way a bit, but the side project’s taken a big step forward…",
            "date_published": "2017-04-29T00:00:00+03:00",
            "date_modified": "2017-04-29T00:00:00+03:00",
            "author": {
              "name": "Gareth Noyce"},
            "tags": ["Shaders","Game Programming"]}]
}